[{"items":[{"title":"Introducing Ext JS 4","thumb":"http://b.vimeocdn.com/ts/110/118/110118333_200.jpg","id":"17666102","description":"Ext JS 4 is a major advance in JavaScript frameworks providing significantly expanded and refactored functionality in practically every area of the product. It's faster, easier and more stable.\n\nPresented by Ed Spencer.\n\nCheck out http://sencha.com/conference for more session videos."},{"title":"What's New in Ext JS 4 (Webinar)","thumb":"http://b.vimeocdn.com/ts/166/239/166239450_200.jpg","id":"25264626","description":"Ext JS 4 raises the bar for cross-browser web apps. New features include plug-in-free charting, fully customizable theming, upgraded components — all packaged in a modern app framework that delivers high-quality, predictable results faster and easier than ever.\n\nJoin us for this one-hour webinar where we'll discuss the new features and benefits of using Ext JS 4. We'll also provide tips and resources for migrating from Ext JS 3 to Ext JS 4.\n\nHosting this webinar from Sencha will be Aditya Bansod, Sr. Director of Product Management, Ed Spencer, Sr. Software Architect, and Brian Moeskau, Sr. Software Architect."},{"title":"Ext JS 3 to 4 Migration, Part 1","thumb":"http://b.vimeocdn.com/ts/149/792/149792412_200.jpg","id":"23027769","description":"In this video tutorial series Brian Moeskau teaches you how to use the Ext compatibility layer to migrate existing Ext 3 applications to Ext 4. The tutorial covers setup, debugging, dealing with common problems, and techniques for properly updating your application code.\n\nPart 1 focuses on the initial setup of the compatibility layer and getting a demo Ext 3 application running under Ext 4 in compatibility mode.\n\nPart 2 builds on the first video, migrating the demo application off of the compatibility layer and getting it fully converted to Ext 4, including using the new class system and dynamic loading.\n\nSee Part 2: http://vimeo.com/23046756\n\nSee the accompanying blog post for more details and to download the Ext JS 3 to 4 Migration Pack: http://www.sencha.com/blog/ext-js-3-to-4-migration"},{"title":"Ext JS 3 to 4 Migration, Part 2","thumb":"http://b.vimeocdn.com/ts/149/936/149936004_200.jpg","id":"23046756","description":"In this video tutorial series Brian Moeskau teaches you how to use the Ext compatibility layer to migrate existing Ext 3 applications to Ext 4. The tutorial covers setup, debugging, dealing with common problems, and techniques for properly updating your application code.\n\nPart 1 focuses on the initial setup of the compatibility layer and getting a demo Ext 3 application running under Ext 4 in compatibility mode.\n\nSee Part 1: http://vimeo.com/23027769\n\nPart 2 builds on the first video, migrating the demo application off of the compatibility layer and getting it fully converted to Ext 4, including using the new class system and dynamic loading.\n\nSee the accompanying blog post for more details and to download the Ext 3 to 4 Migration Pack: http://www.sencha.com/blog/ext-js-3-to-4-migration"}],"title":"Overview"},{"items":[{"title":"The Ext JS 4 Layout System","thumb":"http://b.vimeocdn.com/ts/112/023/112023545_200.jpg","id":"17917111","description":"Ext JS 4 has a fully refactored layout engine with higher efficiency and performance. During this session, you'll learn all the in-depth details with a hands-on coding review of the updated ContainerLayouts and newly introduced ComponentLayouts. \n\nPresented by Jamie Avins.\n\nCheck out http://sencha.com/conference for more session videos."},{"title":"Charting & Data Visualization in Ext JS 4","thumb":"http://b.vimeocdn.com/ts/110/173/110173068_200.jpg","id":"17673342","description":"The exciting future of full JavaScript-powered charts and data visualizations coming in Ext JS 4.0! No Flash required! \n\nPresented by Jamie Avins.\n\nCheck out http://sencha.com/conference for more session videos."},{"title":"Ext JS 4 Architecture","thumb":"http://b.vimeocdn.com/ts/110/628/110628273_200.jpg","id":"17733892","description":"Ext JS 4 has a thoroughly revamped architecture that enables faster performance and more developer flexibility. In this session, we will take a tour through the revamped architecture of Ext JS 4.x, taking a high-level look at the updated data package, component hierarchy and core APIs. Afterwards, developers will have an understanding of why Ext JS 4 works the way it does and how best to leverage its underlying APIs.\n\nPresented by Ed Spencer.\n\nCheck out http://sencha.com/conference for more session videos."},{"title":"JavaScript: Advanced Scoping & Other Puzzles","thumb":"http://b.vimeocdn.com/ts/115/026/115026061_200.jpg","id":"18312985","description":"In this session, we'll review the fundamentals of JavaScript variable scope and common \"execution context\" (scope) challenges associated with early/late binding of event handlers, specifically within complex Ext JS layouts. We'll also bring several patterns (namespaced references, Function closures, inline references, ref/refOwner, and the \"Poor-man's message bus\") to bear on the bowl of soup we call \"scope.\"\n\nPresented by Doug Hendricks.\n\nCheck out http://sencha.com/​conference for more session videos."},{"title":"Behavior Driven Testing with Jasmine","thumb":"http://b.vimeocdn.com/ts/113/422/113422915_200.jpg","id":"18100173","description":"An intro to Jasmine: BDD for JavaScript. We'll talk about why you want to use a test framework for JavaScript testing, why use Jasmine, and review its features, syntax and infrastructure, including how best to incorporate into a Sencha application. \n\nPresented by Davis Frank.\n\nCheck out http://sencha.com/​conference for more session videos."},{"title":"Debugging Your Ext JS Code","thumb":"http://b.vimeocdn.com/ts/113/275/113275508_200.jpg","id":"18080793","description":"To err is human, to code flawlessly is divine. During this session, you'll learn how to debug your JavaScript, Data, and Ext JS based applications using commonly available tools and advanced insight into the Ext JS component framework and life-cycle.\n\nPresented by Aaron Conran & Jarred Nicholls.\n\nCheck out http://sencha.com/​conference for more session videos."}],"title":"Concepts"},{"items":[{"title":"Advanced Server Integration with Data and Direct","thumb":"http://b.vimeocdn.com/ts/111/724/111724762_200.jpg","id":"17876920","description":"Many Ext JS developers have yet to take advantage of Ext Direct to directly call server methods from the browser. During this session, you'll learn how to leverage Ext.Direct's existing functionality to make accessing your server data easier while eliminating common boiler-plate code. This session will spend more time on introductory material. The session repeat on Tuesday will spend more time on advanced material including developing routers, using ColdFusion as an example. \n\nPresented by Aaron Conran.\n\nCheck out http://sencha.com/conference for more session videos."},{"title":"Advanced Templates for Ext JS","thumb":"http://b.vimeocdn.com/ts/111/935/111935062_200.jpg","id":"17905336","description":"In this session you'll learn how to go beyond basic templating and harness the power of XTemplate to create complex, data-bound HTML. We'll show you how to use XTemplate in ways you didn't think were possible. Among other topics, we'll look at Javascript member functions, recursive templates, subtemplates, and layouts for lists. \n\nPresented by James Brantly.\n\nCheck out http://sencha.com/conference for more session videos."},{"title":"Creating Ext JS Extensions and Components","thumb":"http://b.vimeocdn.com/ts/112/046/112046224_200.jpg","id":"17920271","description":"One of the great benefits of developing in Ext JS is its clean extensibility. This lets you create reusable components easily that other developers can simply drop into their own applications with minimal effort. In this session, you'll learn how to create a re-usable component for Ext JS, and I'll describe my own experience creating Ext Scheduler - the scheduling component for Ext JS. \n\nPresented by Mats Bryntse.\n\nCheck out http://sencha.com/conference for more session videos."}],"title":"Components"},{"items":[{"title":"Theming Ext JS 4","thumb":"http://b.vimeocdn.com/ts/121/202/121202378_200.jpg","id":"19159630","description":"Ext JS 4 has a new CSS architecture which uses SASS & Compass. This will enable developers to easily create new themes. During this session you will learn how the Ext JS 4 theme was constructed, how to quickly customize the look and feel of your application and how to optimize your stylesheets for faster downloads."},{"title":"Theming with Sass and Compass","thumb":"http://b.vimeocdn.com/ts/175/125/175125406_200.jpg","id":"26506883","description":"A deep dive into how to use SASS and Compass with Sencha frameworks"},{"title":"SASS - The Next Wave in Styling and Theming","thumb":"http://b.vimeocdn.com/ts/113/301/113301648_200.jpg","id":"18084338","description":"CSS and CSS3 are an amazing toolbox for styling your applications, but they're a challenge to wrangle due to their wordy and encyclopedic nature. SASS is an overlay language for CSS that allows powerful and thorough control of CSS properties with a minimum of typing. In this session, we'll give you a thorough grounder in SASS.\n\nPresented by Chris Eppstein.\n\nCheck out http://sencha.com/​conference for more session videos."}],"title":"Theming"},{"items":[{"title":"Creating Optimal Desktop User Experiences","thumb":"http://b.vimeocdn.com/ts/118/390/118390396_200.jpg","id":"18777458","description":"Great User Experiences savs money in training and support and makes money in strong word-of-mouth marketing as well as customer referrals. However, the techniques and process to make great UX happen are often counter-intuitive and tricky. This session will demystify UX greatness and show you how you can create the optimal desktop user experience. This session will be content-rich with many topics covered."},{"title":"Designing for Accessibility with ARIA","thumb":"http://b.vimeocdn.com/ts/111/451/111451316_200.jpg","id":"17840717","description":"ARIA is an accessibility standard that provides capabilities such as screen-reader access to application functionality. During this session, we'll take a tour of the latest accessibility enhancements to Ext JS and Ext GWT including improved keyboard navigation, ARIA and focus management. We'll also discuss how government standards like Section 508 may apply to your organization. \n\nPresented by Aaron Conran.\n\nCheck out http://sencha.com/conference for more session videos."},{"title":"All About HTML5 Offline Storage","thumb":"http://b.vimeocdn.com/ts/111/478/111478226_200.jpg","id":"17844271","description":"HTML5 gives us a number of different techniques for storing information on the client machine: AppCache for storing local copies of assets, localStorage for quick and simple key/value data, WebSQL and IndexDB for full SQL-like queries, and the FileSystem APIs for reading/writing files to a persistent sandbox. We'll spend time discussing all of these solutions and when you would want to use each. \n\nPresented by Eric Bidelman.\n\nCheck out http://sencha.com/conference for more session videos."},{"title":"Architecting for the Enterprise","thumb":"http://b.vimeocdn.com/ts/114/998/114998224_200.jpg","id":"18309352","description":"Adopting early planning and architectural design strategies is essential to create scalable Enterprise apps that are ready to meet the demands of dynamic workforces, and can scale to meet future business needs. You'll learn how to leverage class-based UI development within evolving Agile/Waterfall development methodologies and how Ext.Direct, Connect, and Ext.data packages can assist with integration. We'll also review best practices for strong, unit-tested foundation classes that will support your 'next' enterprise solution.\n\nPresented by Doug Hendricks.\n\nCheck out http://sencha.com/​conference for more session videos."},{"title":"HTML5: State of the Union","thumb":"http://b.vimeocdn.com/ts/111/160/111160207_200.jpg","id":"17802908","description":"HTML5 has emerged as this year's web technology buzzword, but it's quickly become overloaded and overused. In this session, we'll walk through the various parts of \"HTML5\" separating out the core spec from its satellite specs, as well as the CSS3 family. We'll also take a look at the state of implementations on mobile and desktop browsers.\n\nPresented by Michael Mullany.\n\nCheck out http://sencha.com/conference for more session videos."},{"title":"Sencha Customer Testimonials","thumb":"http://b.vimeocdn.com/ts/105/981/105981266_200.jpg","id":"17131795","description":"Hear how AdMob, Widgetbox, Marketo, and Momentum Design Lab use Sencha frameworks to develop amazing web applications."},{"title":"JavaScript Engines: Under the Hood","thumb":"http://b.vimeocdn.com/ts/118/429/118429198_200.jpg","id":"18783283","description":"A browser's JavaScript engine can seem like a magical black box. During this session, we'll show you how they work from 10,000 feet and give you the tricks to compile all the popular engines out there including JavaScriptCore, V8, and SpiderMonkey). We'll inspect the internals of the engine, and debug+profile your favorite code snippets. Armed with just a little extra knowledge about this black box, you will be ready to take a new look at JavaScript apps."},{"title":"The \"In Action\" Pattern for RIA Development","thumb":"http://b.vimeocdn.com/ts/116/691/116691974_200.jpg","id":"18537381","description":"With RIAs growing in complexity, JavaScript developers today have to make tough choices on how to organize their code and do so in a manner that both allows for growth and ease of management. Often the wrong choices are made, impacting the maintenance cycles of the applications. In this session, we'll discuss exactly how to organize your code from ground up by exploring popular patterns used by today's industry leaders.\n\nPresented by Jay Garcia.\n\nCheck out http://sencha.com/​conference for more session videos."}],"title":"Miscellaneous"}]