[
    {
        id: 1,
        name: "Learning Ext JS",
        author: "Shea Frederick, Colin Ramsay & Steve 'Cutter' Blades",
        detail: "As more and more of our work is done through a web browser, and more businesses build web rather than desktop applications, users want web applications that look and feel like desktop applications. Ext JS is a JavaScript library that makes it (relatively) easy to create desktop-style user interfaces in a web application, including multiple windows, toolbars, drop-down menus, dialog boxes, and much more. Both Commercial and Open Source licenses are available for Ext JS.<br /><br />Ext JS has the unique advantage of being the only client-side UI library that also works as an application development library. Learning Ext JS will help you create rich, dynamic, and AJAX-enabled web applications that look good and perform beyond the expectations of your users.<br /><br />From the building blocks of the application layout, to complex dynamic Grids and Forms, this book will guide you through the basics of using Ext JS, giving you the knowledge required to create rich user experiences beyond typical web interfaces. It will also provide you with the tools you need to use AJAX, by consuming server-side data directly into the many interfaces of the Ext JS component library.",
        price: 38.21,
        image: "resources/images/books/learning-extjs.jpg",
        reviews: [
            {
                author: "Kyle D. Wagner",
                rating: 4,
                date: "May 24, 2009",
                title: "A good introduction to EXT JS",
                comment: "This book is a good introduction to EXT JS. It will teach you the basics and help to get you familiar with writing code in EXT JS and learning the basic syntax. The examples are helpful and most are easy to follow. This book is an introduction because it does not go into much detail about building a complex web application but it will give you the confidence to continue researching and learning EXTJS on your own.<br /><br />I would recommend this book to anyone that has some experience in programming that is looking to start coding in EXT JS. Just dont expect it to teach you everything there is to know, it is more of a stepping stone.<br /><br />Overall, if you are just getting into EXT JS and want a good book to get you started this is the one."
            },
            {
                author: "James P. Stone",
                rating: 4,
                date: "September 22, 2009",
                title: "Good Basic Coverage",
                comment: "This book is good at teaching the basics to get you up and running quickly. In my project, I found myself needing something a bit more advanced for what I was trying to do. My project is requiring the use of DWR and this book does not cover anything related to the DwrProxy. This book also covers the 2.0 version and my project requires the use of 3.0. I also found myself referencing the ExtJs extension project for what I needed to do. I did find some areas where the 2.0 version would not work in 3.0. I would love to see a cook book for ExtJs and J2EE."
            }
        ]
    },
    {
        id: 2,
        name: "Learning Ext JS 3.2",
        author: "Shea Frederick, Colin Ramsay & Steve 'Cutter' Blades and Nigel White",
        detail: "The book provides plenty of fun example code and screenshots to guide you through the creation of examples to assist with learning. By taking a chapter-by-chapter look at each major aspect of the Ext JS framework, the book lets you digest the available features in small, easily understandable chunks, allowing you to start using the library for your development needs immediately. This book is written for Web Application Developers who are familiar with HTML but may have little to no experience with JavaScript application development. If you are starting to build a new web application, or are re-vamping an existing web application, then this book is for you.",
        price: 38.03,
        image: "resources/images/books/learning-extjs-32.jpg",
        reviews: [
            {
                author: "R. Chesley",
                rating: 5,
                date: "Feburary 10, 2011",
                title: "Great overview of ExtJS",
                comment: "I bought the first edition of this book for a project and because of the quality and the addition of more ColdFusion examples picked up this edition. It provides a great overview and supplement to the Ext API documentation with plenty of examples of implemented most of the functionality of Ext (now Sencha). Ext is a deep Javascript framework that is fairly easy to get started with but also a pretty steep learning curve for more complex applications and this book will take you pretty far down the road to mastery.<br /><br />Looking forward to an advanced book that is similar in quality but that provides a more in depth example of how to architect a complex application using the library."
            },
            {
                author: "Peter Kellner",
                rating: 5,
                date: "Jan 2, 2011",
                title: "Great Book! They really got it right on this R2",
                comment: "Most revision 2's of books I've read are just a little cleaning up and republishing the same stuff just to make some more money. These guys, really put a lot of new material here covering much of what was missing from the first book (partly because it was not out yet in the earlier versions of ExtJS). Things like Ext.Direct and graphing are new and covered well.<br /><br />I strongly recommend this book!"
            }
        ]
    },
    {
        id: 3,
        name: "Ext JS in Action",
        author: "Jesus Garcia",
        detail: "Ext JS, a cross-browser JavaScript library for building Rich Internet Applications (RIA), has emerged from the mix of JavaScript frameworks, libraries and object-oriented development techniques as a one of the clear leaders. Ext JS combines an extensive library of super-high-quality widgets, an intuitive, extensible component model, and an easy-to-use API to create a full, rock-solid platform for JavaScript-based web apps. Ext JS has been adopted by such household names as Adobe, Aetna, Amazon.com, Best Buy Hallmark, Panasonic, Pixar Animation Studios, Siemens, Sony, and Visa.<br /><br />Ext JS in Action teaches the reader about Ext from the ground up. By following the common design patterns demonstrated in the Ext source and in many commercial applications, the book teaches you to achieve the same results you see in world-class commercial JavaScript applications. This book will guide you through the Ext component model and layouts. You'll learn how core components, such as the Container class, serve as building blocks for building complex user interfaces. The book fully covers Ext utility classes, AJAX, Observable (the Ext events model), DOM helpers and Function Helpers and illustrates how use of JavaScript Object Notation (JSON), a powerful and lightweight data format, can allow your application to efficiently communicate over the network to the web server. Finally, you'll build on this foundation to customize or extend Ext widgets.<br /><br />Ext JS in Action assumes that you have a solid foundation in JavaScript, but requires no previous exposure to Ext JS.",
        price: 30.81,
        image: "resources/images/books/extjs-in-action.jpg",
        reviews: [
            {
                author: "Deal Stealer",
                rating: 5,
                date: "December 16, 2010",
                title: "Only way to learn ExtJS... At least for me",
                comment: "I initially thought that Sencha would provide developer manual if I paid a license... NOPE! All I got is sample codes and ExtJS Source. By looking at the example code, I thought 'Wow~ great UI widgets! Code seems pretty easy too'. But, I was not able to understand what ExtJS core library is... Even from the Sencha forum, they suggested that the best way to learn is read the example code... it felt a bit like homeless person kicked out during cold winter. In any case, this book really went in depth of what is ExtJS and how I should program. The 'only' negative that I can think of is that ExtJS 4 is just around the corner to be released.. I believe that's sometime in Feb, 2011. Of course, this is the not the fault of the author! Probably just bad timing. Still, I'm pretty sure Jay will come up w/ new version to cover the ExtJS 4 ^_^. Definitely, going to buy it again~"
            },
            {
                author: "R. Peltz",
                rating: 5,
                date: "December 10, 2010",
                title: "Great documentation!",
                comment: "This book really fills in the gaps for me in learning Ext JS. I am really impressed with the approach, the examples, and the readability. I've watched J Garcia's videos and vimeo.com, so I was expecting a good book, but I am really pleased with it's completeness. If you are new to Ext JS, or even if you have been using it for a while, this book is a must!"
            },
            {
                author: "John A. Thompson",
                rating: 5,
                date: "January 8, 2011",
                title: "Best Book for ExtJS.",
                comment: "There are several other ExtJS books out, which I own and have read. This book is by far the best of the options. I met Jay at Senchacon this year and sat through his presentation. Jay has been involved in the ExtJS community for a long time and has been teaching others ExtJS for a long time. In the book he does a great job of presenting ExtJS to the reader. Through his involvement in the ExtJS community, its clear Jay understands common pitfalls that people encounter when learning ExtJS. Jay does a great job of explaining concepts behind ExtJS.<br /><br />If you can by only one book on ExtJS - start here. I lead a small development team & bought copies for each person."
            }
        ]
    },
    {
        id: 4,
        name: "Ext JS 3.0 Cookbook",
        author: "Jorge Ramon",
        detail: "Using Ext JS you can easily build desktop-style interfaces in your web applications. Over 400,000 developers are working smarter with Ext JS and yet most of them fail to exercise all of the features that this powerful JavaScript library has to offer.<br /><br />Get to grips with all of the features that you would expect with this quick and easy-to-follow Ext JS Cookbook. This book provides clear instructions for getting the most out of Ext JS with and offers many exercises to build impressive rich internet applications. This cookbook shows techniques and 'patterns' for building particular interface styles and features in Ext JS. Pick what you want and move ahead.<br /><br />It teaches you how to use all of the Ext JS widgets and components smartly, through practical examples and exercises. Native and custom layouts, forms, grids, listviews, treeviews, charts, tab panels, menus, toolbars, and many more components are covered in a multitude of examples.The book also looks at best practices on data storage, application architecture, code organization, presenting recipes for improving them--our cookbook provides expert information for people working with Ext JS.",
        price: 43.23,
        image: "resources/images/books/extjs-30-cookbook.jpg",
        reviews: [
            {
                author: "Art",
                rating: 5,
                date: "November 23, 2009",
                title: "November 23, 2009",
                comment: "ExtJS 3.0 Cookbook is definitely geared towards JavaScript developers who have some basic understanding of and experience with ExtJS 3.0. If you're brand-new to ExtJS, you may want to wait a few weeks until you've spent some time playing with the various components and layouts that ExtJS offers.<br /><br />As an experienced ExtJS developer, I can say with absolute certainty that I learned some new tricks while reading this book. I wrote a full review on my blog ([...]) but here's the short version.:<br /><br />Ramon's approach to explaining the examples is virtually flawless, and the box-style headers make it easy to follow. I haven't seen too many coding books use this technique, so kudos to whoever thought of it!<br /><br />If I had to pick a single reason to buy ExtJS 3.0 Cookbook, it would definitely be Chapter 9 (Well-Charted Territory).<br /><br />Why?<br /><br />For starters, the ExtJS website samples don't do a great job explaining how to use many of the available charts. The online documentation also lacks direction. Jorge is the first person I've seen who thoroughly explains how to use each type of chart, and his examples are both unique and helpful. Kudos!<br /><br />I've read a lot of programming textbooks, and none are nearly as helpful or interesting as ExtJS 3.0 Cookbook. It is a quick read for containing 356 pages, and Jorge Ramon does a fantastic job offering tips and tricks for ExtJS developers. <br /><br />Regardless of your experience level, the ExtJS 3.0 Cookbook will absolutely teach you something new!"
            },
            {
                author: "Matthew Reid",
                rating: 5,
                date: "December 8, 2009",
                title: "cookbook review",
                comment: "I've been using ExtJS for the last year and have experienced the transition from version 2.0 to 3.0 and have been rather pleased with the results it has delivered for numerous web projects I've coded. After trying many other JS kits and frameworks including Jquery, Mootools, and several others I have generally settled on ExtJS to solve the layout and user interface parts of my applications because of its ease of use and flexible nature for expansion. The framework is an extension of the Yahoo javascript framework, otherwise known as YUI, but with many quality extensions. This book comes as a welcome guide to the general tasks that the framework will solve as well as some of the more unique and in-depth items that it can provide. Quite simply it's a book with over a hundred examples of all the best features of the ExtJS framework. The examples are well explained with detailed write-ups that are fun to read. The examples also have immediately usable code for dropping into place or modifying for your own needs. If you're interested in learning more about this amazing framework or are already acquainted and need a quick guide to expand your abilities, then this will be a good reference to own. Before I get going you can see the book here.<br /><br />The book starts out with an overview of the way that ExtJS handles DOM and data types, which is all very basic stuff but required understanding as well. It's a good start to understanding the base elements if you are a bit rusty. It's also a good chapter to see how ExtJS handles them since it might not be what you are used to if coming from another framework. After enough pages to answer most typical questions of that topic the book dives into the UI building aspects of the framework. This is where things get really good as I've always enjoyed how the framework builds UI for the web. You get examples for containers and positioning, accordion functionality, card and tab based windowing, column and table layouts, and the windowing functions for full browser UI building. I've used many of these features all in one layout and the results are a effective and efficient manner of data distribution and information organization for content driven sites. The book even covers dynamic building of UI elements, which comes in handy for a user interface that grows and changes with the needs of the user.<br /><br />After you build your UI you need methods to get content into the application and ways that the user can interact with the app. The book addresses these needs as well. Plenty of examples abound for all of the required manners that users will be using forms, date fields, combo boxes, remote data loading via JSON and XML, as well as covering grid panels and data tables. Of course it must be mentioned that there are numerous examples that discuss the AJAX features of ExtJS since this is one of it's major strengths and successes. If there's a way to use remote data calls via XML or JSON, it is covered in this book. We also get a nice run down of trees and tab data which is inevitably useful for many purposes. If you are interested in progress bars and customized progress circles the book covers those with over 20 pages of examples. Just before the topics are finished off Jorge covers the functions for building rich charts and graphs. Details involve static data display, remote data display, as well as auto-refresh of data for realtime charting. Patterns, class extensions, plugins, and 'keeping state' are the last topics of the book. They offer quality methods for customizing ExtJS with your own JS code and keeping the user's data consistent between sessions.<br /><br />Overall this is one of the best books I've read about ExtJS. It's as if the author took all of the items that I had to research over the last year of using the framework and put the solutions all into a nicely readable form with quality code examples that are explained in a useful manner. If you are looking for a book that touches upon the most common and some of the more esoteric options of the ExtJS framework but don't feel like scouring the online forums and hundreds of pages of documentation then this is the book for you. If you haven't already built your own code for the features that the chapters discuss then the examples given will save you time and get your projects up and running fast and efficiently."
            },
            {
                author: "George Hernandez",
                rating: 4,
                date: "February 24, 2010",
                title: "Would've been helpful when I was starting",
                comment: "A few years back, I was looking around for a JavaScript library for building interactive web applications. I took a list of JavaScript libraries [Wikipedia], read some reviews, and tried a few of them out. Eventually I settled on Ext JS for several reasons, but what really whetted my appetite was their samples and demo page. Their samples were elegant, powerful, and usually worked on any browser. If you have acquired a hunger for Ext JS, then Ext JS 3.0 Cookbook by Jorge Ramon, can certainly serve you a good number of dishes.<br /><br />When I learned Ext JS, there were no books. I had to learn by playing with the product and by using resources on the Ext JS [extjs.com] website. The examples on site are almost pure code and no explanation (the code is self explanatory!). The API documentation is good but terse and dry with few examples. The forum is excellent and is probably the greatest Ext JS resource --it's like talking to Ext JS experts about your specific problems. As on of the few books on Ext JS, the Ext JS 3.0 Cookbook is a welcome resource. It has examples and explanations!<br /><br />The set up of Ext JS 3.0 Cookbook is useful and simple. Related ' are organized into chapters. A recipe is a specific task of something you want to do with Ext JS. Each recipe is set up, pictures are provided if applicable, then the ingredients (code) is put together step by step. Specific things are emphasized, and explanations are given of how it works.<br /><br />Ext JS 3.0 Cookbook is a great way to jump start a new programmer on Ext JS. The programmer should already know HTML, JavaScript, and client-server interaction across the Web. This book would have been quite useful when I started learning Ext JS, but even now it covers parts of Ext JS that I haven't used yet.<br /><br />Overall, if you need to get a good foothold on Ext JS, then I recommend Ext JS 3.0 Cookbook (2009) by Jorge Ramon and Packt Publishing. If you're using Ext JS and it can help you get over that one little point that you've been stuck on for a few hours, then it's worth it."
            }
        ]
    }
]