[{"items":[{"name":"getting_started","title":"Getting Started with Ext JS 4","description":"This introduction to Ext JS 4 explains how you can get started with creating your first application."},{"name":"upgrade","title":"Upgrade Guide","description":"Learn what's new in Ext JS 4.0 and how to upgrade your existing applications"}],"title":"Overview"},{"items":[{"name":"class_system","title":"The Class System","description":"This manual is intended for any developer who wants to create new or extend existing classes with the new class system in Ext JS 4.x."},{"name":"application_architecture","title":"MVC Application Architecture","description":"Ext JS 4 comes with a new application architecture that not only organizes your code but reduces the amount you have to write."},{"name":"layouts_and_containers","title":"Layouts and Containers","description":"The layout system handles the sizing and positioning of every component in your application."},{"name":"components","title":"Components","description":"A simple example, and videos, about how to create components in Ext JS."},{"name":"data","title":"The Data Package","description":"The data package is what loads and saves all of the data in your application."},{"name":"drag_and_drop","title":"Drag and Drop","description":"This guide explains how to use the drag and drop system."},{"name":"localization","title":"Localization","description":"This guide explains how to localize your application for multiple languages."},{"name":"keyboard_nav","title":"Keyboard Navigation","description":"This guide explains how to use the keyboard navigation system."}],"title":"Concepts"},{"items":[{"name":"grid","title":"The Grid Component","description":"The grid provides a great way to view lots of data at once, formatted exactly how you need it."},{"name":"tree","title":"Trees","description":"Tree and grid now both extend from the same base class. All of the benefits of grid can now be used on trees."},{"name":"drawing_and_charting","title":"Drawing and Charting","description":"The drawing and charting packages enable you to create cross browser and cross device graphics in a versatile way."},{"name":"forms","title":"The Form Package","description":"The Form package enables you to create powerful forms backed with the Ext Data package"},{"name":"theming","title":"Theming","description":"This guide explains how to use the theming system to customize the look and feel of your application."}],"title":"Components"},{"items":[{"name":"mvc_pt1","title":"App Architecture Part 1","description":"Part 1 of a 4 part series explaining how to use Ext JS 4's Application Architecture. This part is all about planning your app"},{"name":"mvc_pt2","title":"App Architecture Part 2","description":"In this article we start creating our Models, Views, Controllers and Stores"},{"name":"mvc_pt3","title":"App Architecture Part 3","description":"In this part of the series, we will continue implementing controller logic inside of the application’s MVC architecture."},{"name":"direct_grid_pt1","title":"Ext Direct and Grid Part 1","description":"How to link an Ext Grid to a PHP / MySQL backend with Ext Direct"},{"name":"direct_grid_pt2","title":"Ext Direct and Grid Part 2","description":"Adding CRUD operations to the Ext Grid using Ext Direct"},{"name":"editable_grid","title":"Editable Grid + Node.js","description":"Creating an Editable Grid backed with Node.js and MongoDB"}],"title":"Tutorials"}]